{
  "application": {
    "generic_en": {
      "name": "Generic English",
      "language": "en",
      "position": "Instrumentation Engineer",
      "body": "Dear Hiring Manager,\n\nI am writing to express my interest in the [Position] position at [Company]. With my background in instrumentation engineering and control systems, I believe I would be a valuable addition to your team.\n\nMy experience includes:\n- Designing and implementing control systems for industrial processes\n- Troubleshooting and maintaining instrumentation equipment\n- Collaborating with cross-functional teams to optimize system performance\n\nI have attached my CV for your review. I would welcome the opportunity to discuss how my skills and experience align with your needs.\n\nThank you for your consideration.\n\nBest regards"
    },
    "generic_fr": {
      "name": "Generic French",
      "language": "fr",
      "position": "Ingénieur en Instrumentation",
      "body": "Madame, Monsieur,\n\nJe vous écris pour exprimer mon intérêt pour le poste de [Position] chez [Company]. Fort de mon expérience en ingénierie d'instrumentation et en systèmes de contrôle, je suis convaincu de pouvoir apporter une contribution significative à votre équipe.\n\nMon expérience comprend :\n- Conception et mise en œuvre de systèmes de contrôle pour les processus industriels\n- Dépannage et maintenance d'équipements d'instrumentation\n- Collaboration avec des équipes interfonctionnelles pour optimiser les performances des systèmes\n\nVous trouverez mon CV en pièce jointe. Je serais ravi de discuter de la façon dont mes compétences correspondent à vos besoins.\n\nJe vous remercie de l'attention que vous porterez à ma candidature.\n\nCordialement"
    },
    "senior_engineer_en": {
      "name": "Senior Engineer (English)",
      "language": "en",
      "position": "Senior Instrumentation Engineer",
      "body": "Dear Hiring Manager,\n\nI am excited to apply for the Senior [Position] role at [Company]. With over X years of experience in industrial automation and instrumentation, I have developed expertise in leading complex projects and mentoring engineering teams.\n\nKey achievements:\n- Led implementation of SCADA systems for Fortune 500 clients\n- Reduced system downtime by 40% through predictive maintenance strategies\n- Managed cross-functional teams of 10+ engineers\n\nI am particularly drawn to [Company]'s innovative approach and would be thrilled to contribute my expertise to your continued success.\n\nPlease find my detailed CV attached. I look forward to discussing this opportunity.\n\nBest regards"
    }
  },
  "followup": {
    "polite_en": {
      "name": "Follow-up #1 - Polite",
      "language": "en",
      "body": "Dear Hiring Manager,\n\nI hope this email finds you well. I wanted to follow up on my application for the [Position] position at [Company], which I submitted on [Date].\n\nI remain very interested in this opportunity and would welcome the chance to discuss how my experience aligns with your team's needs.\n\nPlease let me know if you need any additional information from my end.\n\nThank you for your time and consideration.\n\nBest regards"
    },
    "assertive_en": {
      "name": "Follow-up #2 - Assertive",
      "language": "en",
      "body": "Dear Hiring Manager,\n\nI am following up regarding my application for the [Position] position. I am very enthusiastic about the opportunity to join [Company] and believe my skills would be a strong match for your requirements.\n\nI would appreciate an update on the hiring timeline and next steps. I am happy to provide any additional information or schedule a conversation at your convenience.\n\nLooking forward to your response.\n\nBest regards"
    }
  }
}